app/controllers/api/v1/items_controller.rb

    def index
        items = Item.all
---
SELECT "items".* FROM "items"

    def show
        item = Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        item = Item.create(item_params)
---
INSERT INTO "items" ("name", "created_at", "updated_at", "storage_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "sdlfkjlskejfew"], ["created_at", "2020-03-27 00:18:57.607608"], ["updated_at", "2020-03-27 00:18:57.607608"], ["storage_id", 6]]

    def edit
        item = Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        item = Item.find(params[:id])
        item.update(item_params)
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "quantity" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["quantity", 1], ["updated_at", "2020-03-26 21:31:06.935719"], ["id", 1]]