app/controllers/api/v1/rooms_controller.rb

SELECT "rooms".* FROM "rooms"
---
    def index
        rooms = Room.all

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def show
        room = Room.find(params[:id])

INSERT INTO "rooms" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Bathroom"], ["created_at", "2020-03-25 21:31:54.901887"], ["updated_at", "2020-03-25 21:31:54.901887"], ["user_id", 3]]
---
    def create
        room = Room.create(room_params)

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def edit
        room = Room.find(params[:id])

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "rooms" SET "name" = $1, "updated_at" = $2 WHERE "rooms"."id" = $3  [["name", "Kitchen"], ["updated_at", "2020-03-26 21:29:05.472211"], ["id", 4]]
---
    def update
        room = Room.find(params[:id])
        room.update(room_params)